In [1]:
import pandas as pd
import getpass
import sqlalchemy as sa

In [2]:
driver = 'mysql+pymysql'
user = 'root'
password = getpass.getpass(prompt='Your password:'"")
ip = '127.0.0.1'

Your password:········

In [28]:
connection_string = f'{driver}://{user}:{password}@{ip}'

In [29]:
db_connection = sa.create_engine(connection_string)

In [42]:
insp = sa.inspect(db_connection)
db_list = insp.get_schema_names()
print(db_list)

['bank', 'information_schema', 'lab_db_python_sql', 'mysql', 'performance_schema', 'sakila', 'sys']

1. How many copies of the film Hunchback Impossible exist in the inventory system

In [30]:
query1= '''select film_id, count(inventory_id) as inventory_count from sakila.inventory 
where film_id = (select film_id from sakila.film 
where title = 'Hunchback Impossible') 
group by film_id'''

In [44]:
film_copies = pd.read_sql_query(query1, db_connection)
film_copies.head()

   film_id  inventory_count
0      439                6

In [45]:
'''select title, count(inventory_id) as inventory_count from sakila.inventory
inner join sakila.film
using(film_id) 
where title = "Hunchback Impossible"'''

'select title, count(inventory_id) as inventory_count from sakila.inventory\ninner join sakila.film\nusing(film_id) \nwhere title = "Hunchback Impossible"'

2. List all films whose length is longer than the average of all the films.

In [32]:
query2= '''select title from sakila.film where length > (select avg(length) from sakila.film)'''

In [33]:
length_films = pd.read_sql_query(query2, db_connection)
length_films.head()

              title
0  AFFAIR PREJUDICE
1       AFRICAN EGG
2      AGENT TRUMAN
3   ALAMO VIDEOTAPE
4    ALASKA PHANTOM

3. Use subqueries to display all actors who appear in the film Alone Trip.

In [34]:
query3= '''select first_name, last_name from sakila.actor
where actor_id in
(select actor_id from sakila.film_actor
where film_id in 
(select film_id from sakila.film
where title = 'Alone Trip'))'''

In [35]:
Alone_Trip_actors = pd.read_sql_query(query3, db_connection)
Alone_Trip_actors.head()

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP

4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. 
Identify all movies categorized as family films.

In [36]:
query4= '''select title from sakila.film
where film_id in
(select film_id from sakila.film_category
where category_id in 
(select category_id from sakila.category
where `name` = 'Family'))'''

In [37]:
family_films = pd.read_sql_query(query4, db_connection)
family_films.head()

             title
0      AFRICAN EGG
1    APACHE DIVINE
2   ATLANTIS CAUSE
3  BAKED CLEOPATRA
4        BANG KWAI

5. Get name and email from customers from Canada using subqueries.

In [38]:
query5= '''select first_name, last_name, email from sakila.customer
where address_id in
(select address_id from sakila.address
where city_id in
(select city_id from sakila.city
where country_id in
(select country_id from sakila.country
where country = "Canada")))'''

In [39]:
canada_customers = pd.read_sql_query(query5, db_connection)
canada_customers.head()

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys, that will help you get the relevant information.

In [40]:
query6= '''select first_name, last_name, email from sakila.customer
inner join sakila.address
using(address_id)
inner join sakila.city
using(city_id)
inner join sakila.country
using(country_id)
where country = "Canada"'''

In [41]:
canada_customers_join = pd.read_sql_query(query6, db_connection)
canada_customers_join.head()

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org